app/Models/Product_model.php

SELECT *
FROM `tabel_mobil`
JOIN `tabel_merk` ON `tabel_mobil`.`mobil_id_merk` = `tabel_merk`.`merk_id`
JOIN `tabel_jenis` ON `tabel_mobil`.`mobil_id_jenis` = `tabel_jenis`.`jenis_id`
---
    public function getProduct()
    {
        return  $this->db->table('tabel_mobil')
            ->join('tabel_merk', 'tabel_mobil.mobil_id_merk = tabel_merk.merk_id')
            ->join('tabel_jenis', 'tabel_mobil.mobil_id_jenis = tabel_jenis.jenis_id')
            ->get()->getresultArray();

SELECT *
FROM `tabel_mobil`
JOIN `tabel_merk` ON `tabel_mobil`.`mobil_id_merk` = `tabel_merk`.`merk_id`
JOIN `tabel_jenis` ON `tabel_mobil`.`mobil_id_jenis` = `tabel_jenis`.`jenis_id`
WHERE `mobil_id` = '1'
---
    public function getProductDetail($id)
    {
        return  $this->db->table('tabel_mobil')
            ->join('tabel_merk', 'tabel_mobil.mobil_id_merk = tabel_merk.merk_id')
            ->join('tabel_jenis', 'tabel_mobil.mobil_id_jenis = tabel_jenis.jenis_id')
            ->where(array('mobil_id' => $id))
            ->get()->getresultArray();